package com.feriramara.ukrainianapp;

import android.content.Context;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteQueryBuilder;

import com.readystatesoftware.sqliteasset.SQLiteAssetHelper;

import java.util.ArrayList;

/**
 * Created by Alex on 21.02.2018.
 */

public class DBHelper extends SQLiteAssetHelper {

    private SQLiteDatabase db;

    private static String DATABASE_PATH = "/data/data/com.feriramara.ukrainianapp/databases/";
//    private static final String DATABASE_NAME = "poetry1";



    private static final String DATABASE_NAME = "poetry.db";
    private static final int DATABASE_VERSION = 1;
//
//    private static final String TABLE_NAME = "my1";
//    private static final String AUTHOR_NAME = "name";
//    private static final String TITLE = "title";
//    private static final String TEXT_ACTUALLY = "text";
//    private static final String IMAGE_URL = "image";
//    private static final String FAVOR_IMG = "favorite";

    private Context mContext = null;

    public DBHelper(Context context) {
        super(context, DATABASE_NAME, null, DATABASE_VERSION);
    }

//    @Override
//    public synchronized void close() {
//        if (db != null) {
//            db.close();
//        }
//        super.close();
//    }
//
//    private boolean checkDatabase() {
//        SQLiteDatabase tempDB = null;
//        try {
//            String path = DATABASE_PATH + DATABASE_NAME;
//            tempDB = SQLiteDatabase.openDatabase(path, null, SQLiteDatabase.OPEN_READWRITE);
//        }
//        catch (Exception e) {}
//        if (tempDB != null) {
//            tempDB.close();
//        } return  tempDB!=null?true:false;
//
//    }
//
//    public void copyDataBase() {
//        try {
//            InputStream myInput = mContext.getAssets().open(DATABASE_NAME);
//
//            String outFileName = DATABASE_PATH + DATABASE_NAME;
//
//            OutputStream myOutput = new FileOutputStream(outFileName);
//
//            byte[] buffer = new byte[1024];
//            int length;
//            while ((length = myInput.read(buffer)) > 0) {
//                myOutput.write(buffer, 0, length);
//            }
//            //Close the streams
//            myOutput.flush();
//            myOutput.close();
//            myInput.close();
//        }
//        catch (IOException e) {
//            e.printStackTrace();
//        }
//    }
//
//    public void openDatabase() {
//        String path = DATABASE_PATH + DATABASE_NAME;
//        db = SQLiteDatabase.openDatabase(path, null, SQLiteDatabase.OPEN_READONLY);
//    }
//
//    public void createDatabase() {
//        boolean isExist = checkDatabase();
//        if (isExist) {
//
//        }
//        else {
//            this.getReadableDatabase();
//            try {
//                copyDataBase();
//            }
//            catch (Exception e) {
//
//            }
//
//        }
//    }


    public ArrayList<Card> getAllPoems() {

        String[] sqlSelect = {"id", "author", "title", "favorite", "text"};
        String tableName = "Poems";


        ArrayList<Card> list = new ArrayList<>();
        SQLiteDatabase db = getReadableDatabase();
        SQLiteQueryBuilder qb = new SQLiteQueryBuilder();

        qb.setTables(tableName);
        Cursor c = qb.query(db, sqlSelect, null,null,null,null,null);

        if (c.moveToFirst()) {
            do {
                Card card = new Card();
                card.setId(c.getInt(c.getColumnIndex("id")));
                card.setAuthorName(c.getString(c.getColumnIndex("author")));
                card.setPoetryName(c.getString(c.getColumnIndex("title")));
                card.setText(c.getString(c.getColumnIndex("text")));
                card.setFavorites(c.getInt(c.getColumnIndex("favorite")));
                list.add(card);
            } while (c.moveToNext());
        }

        c.close();
        db.close();
        return list;
    }

    public void addToFavorites(int id) {

        SQLiteDatabase db = getReadableDatabase();
        String query = String.format("UPDATE Poems SET favorite = '1' WHERE id='%s';", id);
        db.execSQL(query);
    }

    public void removeFromFavorites(int id) {

        SQLiteDatabase db = getReadableDatabase();
        String query = String.format("UPDATE Poems SET favorite = '0' WHERE id='%s';", id);
        db.execSQL(query);
    }

    public boolean isFavorite(int id) {
        SQLiteDatabase db = getReadableDatabase();
        String query = String.format("SELECT favorite FROM Poems WHERE id='%s';", id);
        Cursor cursor = db.rawQuery(query, null);
        boolean bul = false;
        if (cursor.moveToFirst()) {
            int num = cursor.getInt(cursor.getColumnIndex("favorite"));
            return (num == 1);

        }
        cursor.close();
        return false;
    }

    public ArrayList<Card> getAllFavorites() {

        String[] sqlSelect = {"id", "author", "title", "favorite", "text"};
        String tableName = "Poems";


        ArrayList<Card> list = new ArrayList<>();
        SQLiteDatabase db = getReadableDatabase();
        SQLiteQueryBuilder qb = new SQLiteQueryBuilder();

        qb.setTables(tableName);
        Cursor c = qb.query(db, sqlSelect, "favorite LIKE 1",null,null,null,null);

        if (c.moveToFirst()) {
            do {
                Card card = new Card();
                card.setId(c.getInt(c.getColumnIndex("id")));
                card.setAuthorName(c.getString(c.getColumnIndex("author")));
                card.setPoetryName(c.getString(c.getColumnIndex("title")));
                card.setText(c.getString(c.getColumnIndex("text")));
                card.setFavorites(c.getInt(c.getColumnIndex("favorite")));
                list.add(card);
            } while (c.moveToNext());
        }

        c.close();
        db.close();
        return list;
    }

    public int getNumberOfAuthors(String author) {
        SQLiteDatabase db = getReadableDatabase();
        String query = String.format("SELECT COUNT(id) FROM Poems WHERE author='%s';", author);
        Cursor cursor = db.rawQuery(query, null);
        int sum = cursor.getCount();

        cursor.close();
        return sum;


    }

    public ArrayList<Card> getCardsByAuthor(String author) {

        String[] sqlSelect = {"id", "author", "title", "favorite", "text"};
        String tableName = "Poems";


        ArrayList<Card> list = new ArrayList<>();
        SQLiteDatabase db = getReadableDatabase();
        SQLiteQueryBuilder qb = new SQLiteQueryBuilder();

        qb.setTables(tableName);
        String query = String.format("author LIKE '%s'", author);
        Cursor c = qb.query(db, sqlSelect, query,null,null,null,null);

        if (c.moveToFirst()) {
            do {
                Card card = new Card();
                card.setId(c.getInt(c.getColumnIndex("id")));
                card.setAuthorName(c.getString(c.getColumnIndex("author")));
                card.setPoetryName(c.getString(c.getColumnIndex("title")));
                card.setText(c.getString(c.getColumnIndex("text")));
                card.setFavorites(c.getInt(c.getColumnIndex("favorite")));
                list.add(card);
            } while (c.moveToNext());
        }

        c.close();
        db.close();
        return list;
    }























//
//    @Override
//    public void onCreate(SQLiteDatabase db) {
////        this.db = db;
////        String CREATION_TABLE = String.format("CREATE TABLE %s ( %s TEXT, %s TEXT, %s INTEGER, %s TEXT, %s INTEGER );", TABLE_NAME, AUTHOR_NAME, TITLE, IMAGE_URL, TEXT_ACTUALLY, FAVOR_IMG);
////        db.execSQL(CREATION_TABLE);
////
////       fillDataBase();
//
//    }


    @Override
    public void onUpgrade(SQLiteDatabase db, int i, int i1) {
//        String query = String.format("DROP TABLE IF EXISTS %s", DATABASE_NAME);
//        db.execSQL(query);
//        onCreate(db);
    }


//    private void addCard(Card card) {
//        ContentValues cv = new ContentValues();
//        cv.put(AUTHOR_NAME, card.getAuthorName());
//        cv.put(TITLE, card.getPoetryName());
//        cv.put(IMAGE_URL, card.getImageURL());
//        cv.put(TEXT_ACTUALLY, card.getText());
//        cv.put(FAVOR_IMG, card.getFavorites());
//        db.insert(TABLE_NAME, null, cv);
//    }



//    private void fillDataBase() {
//
//        Card taras1 = new Card("Тарас Шевчеко", "Заповіт", R.drawable.taras, 0,  "Як умру, то поховайте\n" +
//                "\n" +
//                "Мене на могилі\n" +
//                "\n" +
//                "Серед степу широкого\n" +
//                "\n" +
//                "На Вкраїні милій,\n" +
//                "\n" +
//                "Щоб лани широкополі,\n" +
//                "\n" +
//                "І Дніпро, і кручі\n" +
//                "\n" +
//                "Було видно, було чути,\n" +
//                "\n" +
//                "Як реве ревучий.\n" +
//                "\n" +
//                "Як понесе з України\n" +
//                "\n" +
//                "У синєє море\n" +
//                "\n" +
//                "Кров ворожу... отойді я\n" +
//                "\n" +
//                "І лани і гори —\n" +
//                "\n" +
//                "Все покину, і полину\n" +
//                "\n" +
//                "До самого Бога\n" +
//                "\n" +
//                "Молитися... а до того\n" +
//                "\n" +
//                "Я не знаю Бога.\n" +
//                "\n" +
//                "Поховайте та вставайте,\n" +
//                "\n" +
//                "Кайдани порвіте\n" +
//                "\n" +
//                "І вражою злою кров’ю\n" +
//                "\n" +
//                "Волю окропіте.\n" +
//                "\n" +
//                "І мене в сем’ї великій,\n" +
//                "\n" +
//                "В сем’ї вольній, новій,\n" +
//                "\n" +
//                "Не забудьте пом’янути\n" +
//                "\n" +
//                "Незлим тихим словом.");
//        addCard(taras1);
//        Card taras2 = new Card("Тарас Шевчеко", "Мені однаково", R.drawable.taras, 0, "Мені однаково, чи буду\n" +
//                "Я  жить в Україні, чи ні.\n" +
//                "Чи хто згадає, чи забуде\n" +
//                "Мене в снігу на чужині —\n" +
//                "Однаковісінько мені.\n" +
//                "В неволі виріс між чужими,\n" +
//                "І, неоплаканий своїми,\n" +
//                "В неволі, плачучи, умру,\n" +
//                "І все з собою заберу —\n" +
//                "Малого сліду не покину\n" +
//                "На нашій славній Україні,\n" +
//                "На нашій — не своїй землі.\n" +
//                "I не пом’яне батько з сином,\n" +
//                "Не скаже синові: — Молись.\n" +
//                "Молися, сину: за Вкраїну\n" +
//                "Його замучили колись. —\n" +
//                "Мені однаково, чи буде\n" +
//                "Той син молитися, чи ні…\n" +
//                "Та не однаково мені,\n" +
//                "Як Україну злії люди\n" +
//                "Присплять, лукаві, і в огні\n" +
//                "Її, окраденую, збудять…\n" +
//                "Ох, не однаково мені.");
//        addCard(taras2);
//        Card taras3 = new Card("Тарас Шевчеко", "Причинна", R.drawable.taras, 0, "Реве та стогне Дніпр широкий,\n" +
//                "Сердитий вітер завива,\n" +
//                "Додолу верби гне високі,\n" +
//                "Горами хвилю підійма.\n" +
//                "І блідий місяць на ту пору\n" +
//                "Із хмари де-де виглядав,\n" +
//                "Неначе човен в синім морі,\n" +
//                "То виринав, то потопав.\n" +
//                "Ще треті півні не співали,\n" +
//                "Ніхто нігде не гомонів,\n" +
//                "Сичі в гаю перекликались,\n" +
//                "Та ясен раз у раз скрипів.\n" +
//                "\n" +
//                "В таку добу під горою,\n" +
//                "Біля того гаю,\n" +
//                "Що чорніє над водою,\n" +
//                "Щось біле блукає.\n" +
//                "Може, вийшла русалонька\n" +
//                "Матері шукати,\n" +
//                "А може, жде козаченька,\n" +
//                "Щоб залоскотати.\n" +
//                "Не русалонька блукає –\n" +
//                "То дівчина ходить,\n" +
//                "Й сама не зна (бо причинна),\n" +
//                "Що такеє робить.\n" +
//                "Так ворожка поробила,\n" +
//                "Щоб меньше скучала,\n" +
//                "Щоб, бач, ходя опівночі,\n" +
//                "Спала й виглядала\n" +
//                "Козаченька молодого,\n" +
//                "Що торік покинув.\n" +
//                "Обіщався вернутися,\n" +
//                "Та, мабуть, і згинув!\n" +
//                "Не китайкою покрились\n" +
//                "Козацькії очі,\n" +
//                "Не вимили біле личко\n" +
//                "Слізоньки дівочі:\n" +
//                "Орел вийняв карі очі\n" +
//                "На чужому полі,\n" +
//                "Біле тіло вовки з’їли, –\n" +
//                "Така його доля.\n" +
//                "Дарма щоніч дівчинонька\n" +
//                "Його виглядає.\n" +
//                "Не вернеться чорнобривий\n" +
//                "Та й не привітає,\n" +
//                "Не розплете довгу косу,\n" +
//                "Хустку не зав’яже,\n" +
//                "Не на ліжко – в домовину\n" +
//                "Сиротою ляже!\n" +
//                "\n" +
//                "Така її доля… О боже мій милий!\n" +
//                "За що ж ти караєш її, молоду?\n" +
//                "За те, що так щиро вона полюбила\n" +
//                "Козацькії очі?.. Прости сироту!\n" +
//                "Кого ж їй любити? Ні батька, ні неньки,\n" +
//                "Одна, як та пташка в далекім краю.\n" +
//                "Пошли ж ти їй долю, – вона молоденька,\n" +
//                "Бо люде чужії її засміють.\n" +
//                "Чи винна голубка, що голуба любить?\n" +
//                "Чи винен той голуб, що сокіл убив?\n" +
//                "Сумує, воркує, білим світом нудить,\n" +
//                "Літає, шукає, дума – заблудив.\n" +
//                "Щаслива голубка: високо літає,\n" +
//                "Полине до бога – милого питать.\n" +
//                "Кого ж сиротина, кого запитає,\n" +
//                "І хто їй розкаже, і хто теє знає,\n" +
//                "Де милий ночує: чи в темному гаю,\n" +
//                "Чи в бистрім Дунаю коня напова,\n" +
//                "Чи, може, з другою, другую кохає,\n" +
//                "Її, чорнобриву, уже забува?\n" +
//                "Якби-то далися орлинії крила,\n" +
//                "За синім би морем милого знайшла;\n" +
//                "Живого б любила, другу б задушила,\n" +
//                "А до неживого у яму б лягла.\n" +
//                "Не так серце любить, щоб з ким поділиться,\n" +
//                "Не так воно хоче, як бог нам дає:\n" +
//                "Воно жить не хоче, не хоче журиться.\n" +
//                "«Журись», – каже думка, жалю завдає.\n" +
//                "О боже мій милий! така твоя воля,\n" +
//                "Таке її щастя, така її доля!\n" +
//                "\n" +
//                "Вона все ходить, з уст ні пари.\n" +
//                "Широкий Дніпр не гомонить:\n" +
//                "Розбивши, вітер, чорні хмари,\n" +
//                "Ліг біля моря одпочить,\n" +
//                "А з неба місяць так і сяє;\n" +
//                "І над водою, і над гаєм,\n" +
//                "Кругом, як в усі, все мовчить.\n" +
//                "Аж гульк – з Дніпра повиринали\n" +
//                "Малії діти, сміючись.\n" +
//                "«Ходімо гріться! – закричали. –\n" +
//                "Зійшло вже сонце!» (Голі скрізь;\n" +
//                "З осоки коси, бо дівчата).\n" +
//                ". . . . . . . . . . . . . . .\n" +
//                "«Чи всі ви тута? – кличе мати. –\n" +
//                "Ходім шукати вечерять.\n" +
//                "Пограємось, погуляймо\n" +
//                "Та пісеньку заспіваймо:\n" +
//                "\n" +
//                "Ух! Ух!\n" +
//                "Солом’яний дух, дух!\n" +
//                "Мене мати породила,\n" +
//                "Нехрещену положила.\n" +
//                "\n" +
//                "Місяченьку!\n" +
//                "Наш голубоньку!\n" +
//                "Ходи до нас вечеряти:\n" +
//                "У нас козак в очереті, в осоці,\n" +
//                "Срібний перстень на руці;\n" +
//                "Молоденький, чорнобровий;\n" +
//                "Знайшли вчора у діброві.\n" +
//                "Світи довше в чистім полі,\n" +
//                "Щоб нагулятись доволі.\n" +
//                "Поки відьми ще літають,\n" +
//                "Посвіти нам… Он щось ходить!\n" +
//                "Он під дубом щось там робить.\n" +
//                "\n" +
//                "Ух! Ух!\n" +
//                "Солом’яний дух, дух!\n" +
//                "Мене мати породила,\n" +
//                "Нехрещену положила».\n" +
//                "\n" +
//                "Зареготались нехрещені…\n" +
//                "Гай обізвався; галас, зик,\n" +
//                "Орда мов ріже. Мов скажені,\n" +
//                "Летять до дуба… нічичирк…\n" +
//                "Схаменулись нехрещені,\n" +
//                "Дивляться – мелькає,\n" +
//                "Щось лізе вверх по стовбуру\n" +
//                "До самого краю.\n" +
//                "Ото ж тая дівчинонька,\n" +
//                "Що сонна блудила:\n" +
//                "Отаку-то їй причину\n" +
//                "Ворожка зробила!\n" +
//                "На самий верх на гіллячці\n" +
//                "Стала… в серце коле!\n" +
//                "Подивись на всі боки\n" +
//                "Та й лізе додолу.\n" +
//                "Кругом дуба русалоньки\n" +
//                "Мовчки дожидали;\n" +
//                "Взяли її, сердешную,\n" +
//                "Та й залоскотали.\n" +
//                "Довго, довго дивовались\n" +
//                "На її уроду…\n" +
//                "Треті півні: кукуріку! –\n" +
//                "Шелеснули в воду.\n" +
//                "Защебетав жайворонок,\n" +
//                "Угору летючи;\n" +
//                "Закувала зозуленька,\n" +
//                "На дубу сидячи;\n" +
//                "Защебетав соловейко –\n" +
//                "Пішла луна гаєм;\n" +
//                "Червоніє за горою;\n" +
//                "Плугатар співає.\n" +
//                "Чорніє гай над водою,\n" +
//                "Де ляхи ходили;\n" +
//                "Засиніли понад Дніпром\n" +
//                "Високі могили;\n" +
//                "Пішов шелест по діброві;\n" +
//                "Шепчуть густі лози.\n" +
//                "А дівчина спить під дубом\n" +
//                "При битій дорозі.\n" +
//                "Знать, добре спить, що не чує,\n" +
//                "Як кує зозуля,\n" +
//                "Що не лічить, чи довго жить…\n" +
//                "Знать, добре заснула.\n" +
//                "\n" +
//                "А тим часом із діброви\n" +
//                "Козак виїжджає;\n" +
//                "Під ним коник вороненький\n" +
//                "Насилу ступає.\n" +
//                "«Ізнемігся, товаришу!\n" +
//                "Сьогодні спочинем:\n" +
//                "Близько хата, де дівчина\n" +
//                "Ворота одчинить.\n" +
//                "А може, вже одчинила\n" +
//                "Не мені, другому…\n" +
//                "Швидче, коню, швидче, коню,\n" +
//                "Поспішай додому!»\n" +
//                "Утомився вороненький,\n" +
//                "Іде, спотикнеться, –\n" +
//                "Коло серця козацького\n" +
//                "Як гадина в’ється.\n" +
//                "«Ось і дуб той кучерявий…\n" +
//                "Вона! Боже милий!\n" +
//                "Бач, заснула виглядавши,\n" +
//                "Моя сизокрила!»\n" +
//                "Кинув коня та до неї:\n" +
//                "«Боже ти мій, боже!»\n" +
//                "Кличе її та цілує…\n" +
//                "Ні, вже не поможе!\n" +
//                "«За що ж вони розлучили\n" +
//                "Мене із тобою?»\n" +
//                "Зареготавсь, розігнався –\n" +
//                "Та в дуб головою!\n" +
//                "\n" +
//                "Ідуть дівчата в поле жати\n" +
//                "Та, знай, співають ідучи:\n" +
//                "Як проводжала сина мати,\n" +
//                "Як бивсь татарин уночі.\n" +
//                "Ідуть – під дубом зеленеьким\n" +
//                "Кінь замордований стоїть,\n" +
//                "А біля його молоденький\n" +
//                "Козак та дівчина лежить.\n" +
//                "Цікаві (нігде правди діти)\n" +
//                "Підкралися, щоб ізлякать;\n" +
//                "Коли подивляться, що вбитий, –\n" +
//                "З переполоху ну втікать!\n" +
//                "\n" +
//                "Збиралися подруженьки,\n" +
//                "Слізоньки втирають;\n" +
//                "Збиралися товариші\n" +
//                "Та ями копають;\n" +
//                "Пішли попи з корогвами,\n" +
//                "Задзвонили дзвони.\n" +
//                "Поховали громадою\n" +
//                "Як слід, по закону.\n" +
//                "Насипали край дороги\n" +
//                "Дві могили в житі.\n" +
//                "Нема кому запитати,\n" +
//                "За що їх убито?\n" +
//                "Посадили над козаком\n" +
//                "Явір та ялину,\n" +
//                "А в головах у дівчини\n" +
//                "Червону калину.\n" +
//                "Прилітає зозуленька\n" +
//                "Над ними кувати;\n" +
//                "Прилітає соловейко\n" +
//                "Щоніч щебетати;\n" +
//                "Виспівує та щебече,\n" +
//                "Поки місяць зійде,\n" +
//                "Поки тії русалоньки\n" +
//                "З Дніпра грітись вийдуть.\n" +
//                "\n" +
//                "[1837, С.-Петербург]");
//        addCard(taras3);
//        Card taras4 = new Card("Тарас Шевченко", "Думка", R.drawable.taras, 0, "Тече вода в синє море,\n" +
//                "Та не витікає;\n" +
//                "Шука козак свою долю,\n" +
//                "А долі немає.\n" +
//                "Пішов козак світ за очі;\n" +
//                "Грає синє море,\n" +
//                "Грає серце козацькеє,\n" +
//                "А думка говорить:\n" +
//                "«Куди ти йдеш, не спитавшись?\n" +
//                "На кого покинув\n" +
//                "Батька, неньку старенькую,\n" +
//                "Молоду дівчину?\n" +
//                "На чужині не ті люде,—\n" +
//                "Тяжко з ними жити!\n" +
//                "Ні з ким буде поплакати,\n" +
//                "Ні поговорити».\n" +
//                "Сидить козак на тім боці,—\n" +
//                "Грає синє море.\n" +
//                "Думав, доля зустрінеться,—\n" +
//                "Спіткалося горе.\n" +
//                "А журавлі летять собі\n" +
//                "Додому ключами.\n" +
//                "Плаче козак — шляхи биті\n" +
//                "Заросли тернами.\n" +
//                "\n" +
//                "[1838, С.-Петербург]");
//        addCard(taras4);
//
//        Card taras5 = new Card("Тарас Шевченко", "На вічну пам’ять Котляревському", R.drawable.taras, 0, "Сонце гріє, вітер віє\n" +
//                "З поля на долину,\n" +
//                "Над водою гне вербою\n" +
//                "Червону калину;\n" +
//                "На калині одиноке\n" +
//                "Гніздечко гойдає, –\n" +
//                "А де ж дівся соловейко?\n" +
//                "Не питай, не знає.\n" +
//                "Згадай лихо – та й байдуже…\n" +
//                "Минулось… пропало…\n" +
//                "Згадай добре – серце в’яне:\n" +
//                "Чому не осталось?\n" +
//                "Отож гляну та згадаю:\n" +
//                "Було, як смеркає,\n" +
//                "Защебече на калині –\n" +
//                "Ніхто не минає.\n" +
//                "Чи багатий, кого доля,\n" +
//                "Як мати дитину,\n" +
//                "Убирає, доглядає, –\n" +
//                "Не мине калину.\n" +
//                "Чи сирота, що до світа\n" +
//                "Встає працювати,\n" +
//                "Опиниться, послухає;\n" +
//                "Мов батько та мати\n" +
//                "Розпитують, розмовляють, –\n" +
//                "Серце б’ється, любо…\n" +
//                "І світ божий як великдень,\n" +
//                "І люди як люди.\n" +
//                "Чи дівчина, що милого\n" +
//                "Щодень виглядає,\n" +
//                "В’яне, сохне сиротою,\n" +
//                "Де дітись не знає;\n" +
//                "Піде на шлях подивитись,\n" +
//                "Поплакати в лози, –\n" +
//                "Защебече соловейко –\n" +
//                "Сохнуть дрібні сльози.\n" +
//                "Послухає, усміхнеться,\n" +
//                "Піде темним гаєм…\n" +
//                "Ніби з милим розмовляла…\n" +
//                "А він, знай, співає,\n" +
//                "\n" +
//                "Та дрібно, та рівно, як бога благає,\n" +
//                "Поки вийде злодій на шлях погулять\n" +
//                "З ножем у халайві, – піде руна гаєм,\n" +
//                "Піде та замовкне – нащо щебетать?\n" +
//                "Запеклую душу злодія не спинить,\n" +
//                "Тільки стратить голос, добру не навчить.\n" +
//                "Нехай же лютує, поки сам загине,\n" +
//                "Поки безголов’я ворон прокричить.\n" +
//                "\n" +
//                "Засне долина. На калині\n" +
//                "І соловейко задріма.\n" +
//                "Повіє вітер по долині –\n" +
//                "Пішла дібровою руна,\n" +
//                "Руна гуляє, божа мова.\n" +
//                "Встануть сердеги працювать,\n" +
//                "Корови підуть по діброві,\n" +
//                "Дівчата вийдуть воду брать,\n" +
//                "І сонце гляне, – рай, та й годі!\n" +
//                "Верба сміється, свято скрізь!\n" +
//                "Заплаче злодій, лютий злодій.\n" +
//                "Було так перш – тепер дивись:\n" +
//                "Сонце гріє, вітер віє\n" +
//                "З поля на долину,\n" +
//                "Над водою гне з вербою\n" +
//                "Червону калину;\n" +
//                "На калині одиноке\n" +
//                "Гніздечко гойдає, –\n" +
//                "А де ж дівся соловейко?\n" +
//                "Не питай, не знає.\n" +
//                "\n" +
//                "Недавно, недавно у нас в Україні\n" +
//                "Старий Котляревський отак щебетав;\n" +
//                "Замовк неборака, сиротами кинув\n" +
//                "І гори, і море, де перше витав,\n" +
//                "\n" +
//                "Де ватагу пройдисвіста\n" +
//                "Водив за собою, –\n" +
//                "Все осталось, все сумує,\n" +
//                "Як руїни Трої.\n" +
//                "Все сумує, – тільки слава\n" +
//                "Сонцем засіяла.\n" +
//                "Не вмре кобзар, бо навіки\n" +
//                "Його привітала.\n" +
//                "Будеш, батьку, панувати,\n" +
//                "Поки живуть люди,\n" +
//                "Поки сонце з неба сяє,\n" +
//                "Тебе не забудуть!\n" +
//                "\n" +
//                "Праведная душе! прийми мою мову,\n" +
//                "Не мудру, та щиру. Прийми, привітай.\n" +
//                "Не кинь сиротою, як кинув діброви,\n" +
//                "Прилини до мене, хоч на одно слово,\n" +
//                "Та про Україну мені заспівай!\n" +
//                "Нехай усміхнеться серце на чужині,\n" +
//                "Хоч раз усміхнеться, дивлячись, як ти\n" +
//                "Всю славу козацьку за словом єдиним\n" +
//                "Переніс в убогу хату сироти.\n" +
//                "Прилинь, сизий орле, бо я одинокий\n" +
//                "Сирота у світі, в чужому краю.\n" +
//                "Дивлюся на море широке, глибоке,\n" +
//                "Поплив би на той бік – човна не дають.\n" +
//                "Згадаю Енея, згадаю родину,\n" +
//                "Згадаю, заплачу, як тая дитина.\n" +
//                "А хвилі на той бік ідуть та ревуть.\n" +
//                "А може, я темний, нічого не бачу,\n" +
//                "Злая доля, може, на тім боці плаче, –\n" +
//                "Сироту усюди люде осміють.\n" +
//                "Нехай би сміялись, та там море грає,\n" +
//                "Там сонце, там місяць ясніше сія,\n" +
//                "Там з вітром могила в степу розмовляє,\n" +
//                "Там не одинокий був би з нею й я.\n" +
//                "Праведная душе! прийми мою мову,\n" +
//                "Не мудру, та щиру. Прийми, привітай.\n" +
//                "Не кинь сиротою, як кинув діброви,\n" +
//                "Прилини до мене, хоч на одно слово,\n" +
//                "Та про Україну мені заспівай!\n" +
//                "\n" +
//                "[1838, С.-Петербург]");
//        addCard(taras5);
//        Card lesa1 = new Card("Леся Українка", "Contra spem spero!", R.drawable.lesa, 0, "* Без надії сподіваюсь! (Лат.)\n" +
//                "\n" +
//                "Гетьте, думи, ви хмари осінні!\n" +
//                "То ж тепера весна золота!\n" +
//                "Чи то так у жалю, в голосінні\n" +
//                "Проминуть молодії літа?\n" +
//                "\n" +
//                "Ні, я хочу крізь сльози сміятись,\n" +
//                "Серед лиха співати пісні,\n" +
//                "Без надії таки сподіватись,\n" +
//                "Жити хочу! Геть, думи сумні!\n" +
//                "\n" +
//                "Я на вбогім сумнім перелозі\n" +
//                "Буду сіять барвисті квітки,\n" +
//                "Буду сіять квітки на морозі,\n" +
//                "Буду лить на них сльози гіркі.\n" +
//                "\n" +
//                "І від сліз тих гарячих розтане\n" +
//                "Та кора льодовая, міцна,\n" +
//                "Може, квіти зійдуть – і настане\n" +
//                "Ще й для мене весела весна.\n" +
//                "\n" +
//                "Я на гору круту крем’яную\n" +
//                "Буду камінь важкий підіймать\n" +
//                "І, несучи вагу ту страшную,\n" +
//                "Буду пісню веселу співать.\n" +
//                "\n" +
//                "В довгу, темную нічку невидну\n" +
//                "Не стулю ні на хвильку очей –\n" +
//                "Все шукатиму зірку провідну,\n" +
//                "Ясну владарку темних ночей.\n" +
//                "\n" +
//                "Так! я буду крізь сльози сміятись,\n" +
//                "Серед лиха співати пісні,\n" +
//                "Без надії таки сподіватись,\n" +
//                "Буду жити! Геть, думи сумні!");
//        addCard(lesa1);
//        Card lesa2 = new Card("Леся Українка", "Сон", R.drawable.lesa, 0, "Був сон мені колись: богиню ясну\n" +
//                "Фантазії вбачали мої очі,\n" +
//                "\n" +
//                "І друга любого подобу красну\n" +
//                "Богиня прийняла тієї ночі.\n" +
//                "\n" +
//                "Той самий вираз і усмішка мила,\n" +
//                "Той самий погляд довгий, розумливий,\n" +
//                "\n" +
//                "На плечах лиш барвисті мала крила,\n" +
//                "Вінець над чолом з лавру святобливий.\n" +
//                "\n" +
//                "Вона іде! Непереможна сила\n" +
//                "Мене примушує за нею простувати\n" +
//                "\n" +
//                "По темних, тісних хідниках. Вступила\n" +
//                "Вона в якісь таємнії палати.\n" +
//                "\n" +
//                "Чи то свята будова, чи темниця?\n" +
//                "Високеє і темнеє склепіння,\n" +
//                "\n" +
//                "Одно віконце вузьке, мов стрільниця, –\n" +
//                "Крізь нього сиплеться бліде проміння\n" +
//                "\n" +
//                "І падає на стіну; височенний\n" +
//                "Орган стоїть там, наче скеля дика,\n" +
//                "\n" +
//                "Де був прикований Титан страшенний,\n" +
//                "Що забажав освіти чоловіка.\n" +
//                "\n" +
//                "Спинилася богиня, і за руку\n" +
//                "Взяла мене, і словом говорила:\n" +
//                "\n" +
//                "«Вважай і пам’ятай мої слова й науку:\n" +
//                "То світовий орган, і доля так судила,\n" +
//                "\n" +
//                "Що тільки раз він має гук подати,\n" +
//                "Страшний той гук, потужний і величний,\n" +
//                "\n" +
//                "По всіх країнах має залунати\n" +
//                "І перекинути світовий стрій одвічний.\n" +
//                "\n" +
//                "Страшне повстане скрізь землі рушення.\n" +
//                "І в громом упадуть міцні будови.\n" +
//                "\n" +
//                "Великий буде жах, велике й визволення!\n" +
//                "Тоді спадуть всесвітнії окови.\n" +
//                "\n" +
//                "І правда лавром чоло уквітчає.\n" +
//                "І згине зло, укриване віками.\n" +
//                "\n" +
//                "В честь волі нової хвалу співець заграє\n" +
//                "На вільних струнах вільними руками.\n" +
//                "\n" +
//                "Тож слухай: ти орган порушить можеш\n" +
//                "Не дужою, та смілою рукою,\n" +
//                "\n" +
//                "Всесвітнє зло тим гуком переможеш,\n" +
//                "Здобудеш для землі і щастя, і спокою.\n" +
//                "\n" +
//                "Та знай: твоє життя так миттю згасне,\n" +
//                "Як блискавка, що перед громом свіне:\n" +
//                "\n" +
//                "Не для тебе те світло правди ясне,\n" +
//                "Що світ осяє, ні! життя твоє загине!\n" +
//                "\n" +
//                "І вільні струни славити не будуть\n" +
//                "Ні твого ймення, ані твого діла,\n" +
//                "\n" +
//                "Щасливії нещасную забудуть,\n" +
//                "Не буде вкрита лаврами могила!»\n" +
//                "\n" +
//                "Промовила і зникла. В самотині\n" +
//                "Я зостаюся розважать-гадати,\n" +
//                "\n" +
//                "Як визволить той гук, що замкнутий в скелині,\n" +
//                "Що має гучно в світі залунати?\n" +
//                "\n" +
//                "Тут наступила чорна тьма без сонця,\n" +
//                "Я в розпачі ламаю руки, плачу,\n" +
//                "\n" +
//                "Богиню кличу… Коли се з віконця\n" +
//                "Я бачу світло, ясний промінь бачу!\n" +
//                "\n" +
//                "Той промінь думки просвітив бездольні,\n" +
//                "Ще хвиля – й світ весь затремтять від гуку, –\n" +
//                "\n" +
//                "Зрадіють всі невільники бездольні…\n" +
//                "Та що це нагле затримало руку?\n" +
//                "\n" +
//                "Ох, я ж загинуть маю!.. І від страху\n" +
//                "Від жалю розум наче хмари вкрили.\n" +
//                "\n" +
//                "Як тяжко! Мов серце извне жаху:\n" +
//                "Умру без слави, навіть без могили!..\n" +
//                "\n" +
//                "І я стою, неначе скам’яніла.\n" +
//                "Знебула думка вже не розважає…\n" +
//                "\n" +
//                "Що се? немовби пісня забриніла\n" +
//                "Здалека, мовби цілий хор ридає.\n" +
//                "\n" +
//                "Глибока, тиха, нерозважна туга\n" +
//                "Вникає в серце, каменем лягає;\n" +
//                "\n" +
//                "Ридає хор, мов дикий вітер з луга,\n" +
//                "А темрява склепіння застилає.\n" +
//                "\n" +
//                "З віконця ледве-ледве блисне промінь;\n" +
//                "Ті хмари темні давлять мою душу,\n" +
//                "\n" +
//                "А серце палять, мов жерущий пломінь.\n" +
//                "Ні, гук страшний я видобути мушу!\n" +
//                "\n" +
//                "Хай я загину, та хай сяє мило\n" +
//                "Над людьми сонцем правда і надія!\n" +
//                "\n" +
//                "Зважливо простягаю руку, сміло –\n" +
//                "І прокидаюсь… Так! то сон був… мрія!");
//        addCard(lesa2);
//        Card lesa3 = new Card("Леся Українка", "Вечірня година", R.drawable.lesa, 0, "Уже скотилось із неба сонце,\n" +
//                "Заглянув місяць в моє віконце.\n" +
//                "Вже засвітились у небі зорі,\n" +
//                "Усе заснуло, заснуло й горе.\n" +
//                "Вийду в садочок та погуляю,\n" +
//                "При місяченьку та й заспіваю.\n" +
//                "Як же тут гарно, як же тут тихо,\n" +
//                "В таку годину забудеш лихо!\n" +
//                "Кругом садочки, біленькі хати,\n" +
//                "І соловейка в гаю чувати.\n" +
//                "Ой, чи так красно в якій країні,\n" +
//                "Як тут, на нашій рідній Волині!\n" +
//                "Ніч обгорнула біленькі хати,\n" +
//                "Немов маленьких діточок мати,\n" +
//                "Вітрець весняний тихенько дише,\n" +
//                "Немов діток тих до сну колише.");
//        addCard(lesa3);
//        Card lesa4 = new Card("Леся Українка", "Завітання", R.drawable.lesa, 0, "В темну безсонную ніч, в передсвітнюю чорну годину,\n" +
//                "Втомленим очам моїм вельми дивна поява з’явилась:\n" +
//                "Темно-червонее світло, неначе той одблиск пожежі,\n" +
//                "Лихо віщуючий, темряву ночі розсунув.\n" +
//                "В світлі з’явилася генія темная постать.\n" +
//                "Довга та чорная шата, мов хмара, його покривала\n" +
//                "І хвилювала в повітрі, як море в негоду,\n" +
//                "Сталі холодної полиском крила широкі ясніли;\n" +
//                "Кучері чорні та довгі спадали на плечі.\n" +
//                "В темних та гострих очах його погляд непевний світився, –\n" +
//                "Сумно дивився в простор, і палкії лилися з них сльози.\n" +
//                "Горе тому, в чиє серце ті сльози огнистії кануть:\n" +
//                "Лихо та горе, всесвітню нікчемність побачить він разом,\n" +
//                "В серці в його запалає той пломінь страшенний, жерущий,\n" +
//                "Що у тім погляді жевріє, – і безнадійність,\n" +
//                "Тяжка, понура, обгорне його, наче хмара осіння.\n" +
//                "Скована жахом, я погляд спустила додолу.\n" +
//                "Він же промчав, наче вітер, і зник у просторі.\n" +
//                "\n" +
//                "Темрява знов залягла, ще чорніша, ще глибша.\n" +
//                "Вечір був місячний, ясний, і зорі лагідно сіяли;\n" +
//                "Тихо було у повітрі, вітрець тільки часом\n" +
//                "Легким крильцем повівав – і далеко, далеко\n" +
//                "Із-за гори десь доносився гук від вечірнього дзвона.\n" +
//                "Довгая біла стяга простелилась від срібного сяйва\n" +
//                "В хаті моїй, – надто ясно вже світач рогатий\n" +
//                "Ночі тієї світив. Якась тінь у тім сяйві з’явилась,\n" +
//                "Легка, блакитна, прозора і невиразна, як мрія.\n" +
//                "Геній то був, але геній не той, що з’являвся\n" +
//                "Темної ночі тоді, коли жахом скував мою душу.\n" +
//                "Тихо стояв він, і ледве що маяла шата прозора;\n" +
//                "Кучері яснії, легкі вилися над чолом лагідним,\n" +
//                "Білії крила сріблясті леліли у місячнім сяйві,\n" +
//                "Яснії очі були, і погляд їх був, наче промінь;\n" +
//                "Яснії очі були, але в очах тих сльози блищали;\n" +
//                "Погляд лагідний він мав, але в погляді смуток глибокий:\n" +
//                "Жаль і благання, надія і туга-журба одбивались.\n" +
//                "Руки до мене простяг і мов кликав кудись за собою,\n" +
//                "Любо всміхався, а сльози котились. Ті сльози\n" +
//                "Падали в серце мені; і од сліз тих надія ясная,\n" +
//                "Радісна тиха надія, мов квітка лелії, розквітла.\n" +
//                "Любо всміхався, від усміху того у серці\n" +
//                "Радісна, тиха надія, мов квітка лілеї, розквітла.\n" +
//                "Людська недоля будила не розпач в мені, а бажання\n" +
//                "Кращої долі, яснішої, – той ідеал мені сяяв\n" +
//                "В погляді яснім, і серце за ним поривалося линуть.\n" +
//                "Він подивився на мене журливо – і серцем я вчула,\n" +
//                "Що у небесні простори несила моя ще полинуть…\n" +
//                "Зник він, як мрія, як срібний туман проти сонця.\n" +
//                "Зоря на небі рожева уже починала займатись,\n" +
//                "Із-за гори десь доносився гук від далекого дзвона…");
//        addCard(lesa4);
//        Card lesa5 = new Card("Леся Українка", "В небі місяць", R.drawable.lesa, 0, "В небі місяць зіходить смутний,\n" +
//                "Поміж хмарами вид свій ховає,\n" +
//                "\n" +
//                "Його промінь червоний, сумний\n" +
//                "Поза хмарами світить-палає.\n" +
//                "\n" +
//                "Мов пожежа на небі горить,\n" +
//                "Землю ж темнії тіні вкривають,\n" +
//                "\n" +
//                "Ледве промінь прорветься на мить,\n" +
//                "Знову хмари, мов дим, застилають.\n" +
//                "\n" +
//                "Крізь темноту самотно зорить\n" +
//                "Одинокая зірка ясная,\n" +
//                "\n" +
//                "Її промінь так гордо горить,\n" +
//                "Не страшна їй темнота нічная!\n" +
//                "\n" +
//                "Гордий промінь в тієї зорі,\n" +
//                "Та в нім туга палає огниста,\n" +
//                "\n" +
//                "І сіяє та зірка вгорі,\n" +
//                "Мов велика сльоза промениста.\n" +
//                "\n" +
//                "Чи над людьми та зірка сумна\n" +
//                "Променистими слізьми ридає?\n" +
//                "\n" +
//                "Чи того, що самотна вона\n" +
//                "По безмірнім просторі блукає?..");
//        addCard(lesa5);
//
//
//
//    }
}


